/*
    AlphaScale AS3310B Soc Header File
    Define all registers IO prots .. etc

    Last Modify:
    2006-11-22 Hoffer
        Switch to AS3310C

    2006-05-26 Hoffer
        Create File.
 */

#include <asm/arch/sizes.h>

#ifndef __ALPSCALE_AS3310B_H__
#define __ALPSCALE_AS3310B_H__


#ifndef __ASSEMBLY__
typedef volatile unsigned char AS3310_REG8;
typedef volatile unsigned short AS3310_REG16;
typedef volatile unsigned long AS3310_REG32;

#endif

#define REG_VAL 0
#define REG_SET 1
#define REG_CLR 2
#define REG_TOG 3

/*      LCD     */
#define HW_LCDIF_CTRL    0x80000200
#define HW_LCDIF_TIMING  0x80000210
#define HW_LCDIF_DATA    0x80000220
#define HW_LCDIF_DEBUG   0x80000230

/*      LCD CONTORL      */
#define LCDCTRL_BASE_ADDRESS 0x80028000

#define	HW_LCDCTRL_CTRL0_ADDR       LCDCTRL_BASE_ADDRESS
#define	HW_LCDCTRL_CTRL1_ADDR       LCDCTRL_BASE_ADDRESS + 0x10
#define	HW_LCDCTRL_DATA_ADDR        LCDCTRL_BASE_ADDRESS + 0x20
#define	HW_LCDCTRL_TIMING0_ADDR	    LCDCTRL_BASE_ADDRESS + 0x30
#define	HW_LCDCTRL_TIMING1_ADDR	    LCDCTRL_BASE_ADDRESS + 0x40
#define	HW_LCDCTRL_TIMING2_ADDR	    LCDCTRL_BASE_ADDRESS + 0x50
#define	HW_LCD_FIFO_STAT_ADDR	    LCDCTRL_BASE_ADDRESS + 0x60
#define	HW_LCD_STAT_ADDR	        LCDCTRL_BASE_ADDRESS + 0x70
#define	HW_LCD_SUBPANEL_ADDR	    LCDCTRL_BASE_ADDRESS + 0x80
#define	HW_LCD_LINEINT_ADDR	        LCDCTRL_BASE_ADDRESS + 0x90
#define	HW_LCD_DISPLAYSTATUS_ADDR   LCDCTRL_BASE_ADDRESS + 0xA0

#define	HW_EMI_SMSKR4           0x80700064
#define	HW_EMI_SMSKR5           0x80700068
#define	HW_EMI_SMSKR6           0x8070006c
#define	HW_EMI_SMSKR7           0x80700070

#define	HW_EMI_CSALIAS0_LOW     0x80700074
#define HW_EMI_CSALIAS1_LOW     0x80700078

#define HW_EMI_CSREMAP0_LOW     0x80700084
#define HW_EMI_CSREMAP1_LOW     0x80700088

#define HW_EMI_SMTMGR_SET0      0x80700094
#define HW_EMI_SMTMGR_SET1      0x80700098
#define HW_EMI_SMTMGR_SET2      0x8070009c

#define HW_EMI_FLASH_TRPDR      0x807000a0
#define HW_EMI_SMCTLR           0x807000a4
#define	HW_EMI_EXN_MODE_REG     0x807000ac

/* audio */
#define HW_AUDIO_OUT_CTRL       0x80048000
#define HW_AUDIO_IN_CTRL        0x8004c000
#define HW_AUDIO_OUT_PWRD_CTRL  0x80048070
#define HW_AUDIO_OUT_REF_CTRL   0x80048080

/*
 * SRAM
 */

#define ALPAS3310_SRAM_BASE 0x40000000
#define ALPAS3310_SRAM_SIZE 0x00008000


/*
 * SDRAM
 */

#define ALPAS3310_SDRAM_BASE 0x20000000
#define ALPAS3310_SDRAM_SIZE 0x04000000

/*
 * Memory chunk set aside for the Framebuffer in SRAM
 */
#define SRAM_FRAMEBUFFER_MEMORY ALPAS3310_SRAM_BASE

/*
Enthernet LAN91C96
*/
#define ALPAS3310_LAN91C96_BASE 0x30000000


/* Macros to access registers */
#define outb(v,p) *(volatile u8 *) (p) = v
#define outw(v,p) *(volatile u16 *) (p) = v
#define outl(v,p) *(volatile u32 *) (p) = v

#define inb(p)	*(volatile u8 *) (p)
#define inw(p)	*(volatile u16 *) (p)
#define inl(p)	*(volatile u32 *) (p)

#define as_outb(v,p) *(volatile u8 *) (p) = v
#define as_outw(v,p) *(volatile u16 *) (p) = v
#define as_outl(v,p) *(volatile u32 *) (p) = v

#define as_inb(p)	*(volatile u8 *) (p)
#define as_inw(p)	*(volatile u16 *) (p)
#define as_inl(p)	*(volatile u32 *) (p)


/*			CLK BASE			*/
#define AS3310_CLK_BASE         0x80040000

/*			GPMI BASE			*/
#define AS3310_GPMI_BASE	0x8000C000


#ifndef __ASSEMBLER__

#define PCIO_BASE		0

/*
 * RAM definitions
 */
#define MAPTOPHYS(a)		((unsigned long)(a) - PAGE_OFFSET)
#define KERNTOPHYS(a)		((unsigned long)(&a))
#define KERNEL_BASE		(0x20008000)
#endif

/* macro to get at IO space when running virtually */
#define IO_ADDRESS(x) ((x))


/*
 * ALPAS3310 UART3 Registers
 */

#define ALPAS_MPU_UART3_BASE  ALPAS3310_UART1_BASE /* UART3 through MPU bus */

/*
 * MMC/SD Host Controller Registers
 */


/*
 * Memory chunk set aside for the Framebuffer in SRAM
 */
#define SRAM_FRAMEBUFFER_MEMORY ALPAS3310_SRAM_BASE



/* ---------------------------------------------------------------------------
 *  ALPAS3310 GPIO (SHARED)
 * ---------------------------------------------------------------------------
 *
 */
#define GPIO_DATA_INPUT_REG	(ALPAS3310_GPIO_BASE)
#define GPIO_DATA_OUTPUT_REG	(ALPAS3310_GPIO_BASE)
#define GPIO_DIR_CONTROL_REG	(ALPAS3310_GPIO_BASE + 0x8)
#define GPIO_INT_CONTROL_REG	(ALPAS3310_GPIO_BASE + 0xc)
#define GPIO_INT_MASK_REG	(ALPAS3310_GPIO_BASE + 0x10)
#define GPIO_INT_STATUS_REG	(ALPAS3310_GPIO_BASE + 0x14)
#define GPIO_PIN_CONTROL_REG	(ALPAS3310_GPIO_BASE + 0x18)



#ifndef __ASSEMBLY__


typedef struct {
		AS3310_REG32		CTRL0[4]	 ;	//	0x00	R/W		
		AS3310_REG32		COMPARE[4]   ;  //	0x10	R/W 
		AS3310_REG32		CTRL1[4]     ;  //	0x20	R/W 
		AS3310_REG32		TIMING0[4]	 ;  //	0x30	R/W 
		AS3310_REG32		TIMING1[4]   ;  //	0x40	R/W 
		AS3310_REG32		TIMING2[4]   ;  //	0x50	R/W 
		AS3310_REG32		DATA[4]      ;  //	0x60	R/W 
		AS3310_REG32		STAT[4]      ;  //	0x70	R	
		AS3310_REG32		DEBUG[4]     ;  //	0x80	R
} /*__attribute__((__packed__))*/ AS3310_GPMI;


static inline AS3310_GPMI * const AS3310_GetBase_GPMI(void)
{
	return (AS3310_GPMI * const)AS3310_GPMI_BASE;
}


/****************************************************************************************************************
* #define DMA_SET_PKG(dma_cmd_pkg_addr,next_pkg_addr,ctrl_dword,buffer_addr,cmd_dword) \                        *
* do {   volatile long * temp_mem;                                  \                                           *
*     temp_mem=(volatile long*)dma_cmd_pkg_addr;               \                                                *
*     *temp_mem=next_pkg_addr;                            \                                                     *
*     temp_mem+=1;                                    \                                                         *
